{
  "Lemon Cream Pie": {
    "Description": "The combination of lemon and sour cream give this pie a smooth texture and tangy taste.  Just perfect with the graham cracker crust.",
    "Equipment": "Equipment\nPie Plate (9in)\nMeasuring Cups\nMeasuring Spoons",
    "Ingredients": "Pie Filling\n1 cup Sugar\n3 Tbsp cornstarch plus 1-1/2 tsp\n1 Tbsp grated lemon peel\n1/2 cup lemon juice\n3 egg yolks lightly beaten\n1 cup milk\n1/4 cup butter cubed\n8 oz sour cream\n1 cup heavy whipping cream whipped\n* Lemon twists for garnish\nGraham Cracker Crust\n1 1/4 cup graham cracker crumbs\n5 Tbsp butter melted\n2 Tbsp sugar\n",
    "Steps": "Pie Filling\nCombine sugar, cornstarch, lemon peel, juice, egg yolks and milk in heavy saucepan\nCook over medium heat until thickened. Stir in butter\nCool mixture to room temperature and add in sour cream\nPour into Graham Cracker Crust\nTop with Whipped Cream and garnish as desired.\nRefrigerate until ready to serve\nGraham cracker crust\nMix together graham cracker crumbs, melted butter and sugar with a fork\nPour the crumbs into a pie plate\nUse your measuring cup to press crumbs into bottom and sides of pie plate\nBake at 325 until the crust begins to brown - about 15-20 minutes\nAllow to cool and keep stored in refrigeator\nNotes\nIf you prefer, you can use a pastry crust instead of a graham cracker crust. Use my recipe for the perfect pie crust found here.\nIf using a graham cracker curst, use your measuring cup to press the crumbs into the bottom and sides of the pie pan to get a nice smooth, even crust!",
    "Nutrition": "Calories: 523kcal | Carbohydrates: 47g | Protein: 4g | Fat: 35g | Saturated Fat: 20g | Cholesterol: 166mg | Sodium: 266mg | Potassium: 148mg | Sugar: 33g | Vitamin A: 1160IU | Vitamin C: 7.3mg | Calcium: 108mg | Iron: 0.9mg",
    "Dietary Restriction": "Vegetarian, Gluten-Free",
    "Spice Level": "",
    "Price Range": "expensive"

  },

  "Orange Chicken": {
    "Description": "Delicious orange chicken, just like the dish served at your favorite take out restaurant.\n",
    "Equipment": "Juicer\nMicroplane\nMeasuring Cups",
    "Ingredients": "Chicken\n2 lbs boneless skinless chicken breasts cut into 1-1/2” cubes\n1 ½ cups all purpose flour\n1 eggs beaten\n¼ tsp salt\n¼ tsp pepper\nOil for frying\nOrange Sauce\n1 ½ cups water\n2 Tbsps orange juice\n¼ cup lemon juice\n1/3 cup rice vinegar\n2 ½ Tbsp soy sauce\n1 Tbsp orange zest grated\n1 Cup brown sugar packed\n½ tsp ginger root minced\n½ tsp garlic minced\n2 Tbsp green onion chopped\n¼ tsp red pepper flakes\n3 Tbsp cornstarch\n2 Tbsp water\n",
    "Steps": "Combine flour, salt, and pepper.\nDip chicken in egg mixture and shake in flour mixture to coat.\nDeep fry chicken in batches at 375 degrees in a deep fryer (or use a wok) until completely cooked.\nMeanwhile, in a large saucepan combine 1 ½ cups water, lemon juice, orange juice, rice vinegar, and soy sauce.\nBlend well over medium heat for a few minutes.\nStir in brown sugar, orange zest, ginger garlic, and onion. Bring to a boil.\nCombine 3 tablespoons of cornstarch with 1/4 cup of water and mix thoroughly.\nSlowly stir cornstarch mixture into sauce until it thickens.\nPour sauce over breaded chicken, and if desired add red pepper flakes and garnish with green onions\n",
    "Nutrition": "Calories: 465kcal | Carbohydrates: 65g | Protein: 37g | Fat: 4g | Saturated Fat: 1g | Cholesterol: 124mg | Sodium: 718mg | Potassium: 689mg | Fiber: 1g | Sugar: 36g | Vitamin A: 140IU | Vitamin C: 10.3mg | Calcium: 49mg | Iron: 2.6mg",
    "Dietary Restriction": "",
    "Spice Level": "Mild",
    "Price Range": "affordable"

  },
  "California Sushi Rolls": {
    "Description": "A classic sushi roll filled with fresh avocado, cucumber, and crab meat.",
    "Equipment": "Seaweed Sheets\nGreen Bamboo Sushi Roller Mat\nNatural Bamboo Sushi Mat\nRice Paddle, Spreader ",
    "Ingredients": "1 ½ cups sushi rice\n2 ¼ cups water\n2 tablespoons seasoned rice vinegar\n1 teaspoon salt\n1 teaspoon sugar\n1 avocado\n½ English cucumber\n8 ounces imitation crab, log/leg style works better than chunks\n4 sheets toasted nori seaweed",
    "Steps": "Rinse off the rice in a colander. In a pot with a lid add the rice and the water. Turn heat to high and bring to a boil. Once boiling keep the lid on and reduce to low for 15 minutes until all the water has been absorbed. While the rice is cooking in a small bowl add the rice vinegar, sugar, and salt. Whisk together until the sugar and salt are dissolved into the vinegar.\nOnce the rice is ready carefully transfer the rice to a sheet pan. Sprinkle the rice vinegar mixture over the rice and toss the rice in the vinegar to coat as much of it as possible. Now spread the rice out over the whole sheet pan making an even thin layer of rice to cool it down. Wait 10 minutes before rolling the sushi.\nWhile the rice is cooking and cooling prepare the vegetables for filling. Thinly slice the avocado. Peel and cut the cucumber in half and use a spoon to remove the seeds, then continue to cut the cucumber into long thin strips.\nWhile you finish waiting for the rice to cool set up your work station for rolling. You will need a sushi mat, a scoop and 1 cup measuring cup for the rice, a small bowl of room temperature water for your fingers, and a serated knife. Note to keep the water close, keeping your hands wet will keep the rice from sticking to you during the process.\nOnce rice is ready measure it out into a 1 cup measuring cup, you will use 1 cup of rice for each roll. Now take a sheet of seaweed and lay the shinier side down on the sushi mat, keep in the center with the bottom flush against the edge of the mat. Dip your fingers in the bowl of water letting excess water drip off. Transfer the cup of rice onto the center of the seaweed. Now with your wet fingers (you can dip them in more water if needed) spread out the rice to the flush bottom, sides, and up to the top of the seaweed until about the last inch, leave a narrow strip of seaweed uncovered at the top, about 1 inch.\nOnce rice is spread out in the center add a line of the avocado, crab, and cucumber.\nNow carefully take the flush edge of the mat and fold it up over the fillings. Then pulling the mat tightly over the fillings creating the center of the roll. Pull down the mat off the seaweed and roll the rest of the roll up to create a lof shape. Bring the mat back overtop of the log and up the log into the mat. Pick it up and gently give the whole thing a squeeze to keep it in a circular shape. Now unwrap the mat and you should have a california roll!\nDip the serated knife into the water bowl (like with your fingers to keep it from sticking). And carefully cut the sushi into 8 pieces.",
    "Nutrition": "Calories: 140kcal | Carbohydrates: 27g | Protein: 5g | Fat: 1g | Saturated Fat: 0g | Cholesterol: 6mg | Sodium: 642mg | Potassium: 71mg | Fiber: 1g | Sugar: 3.2g | Vitamin A: 6mcg | Vitamin C: 1.4mg | Calcium: 9mg | Iron: 0.3mg",
    "Dietary Restriction": "",
    "Spice Level": "",
    "Price Range": "cheap"

  }
}